In [2]:
import sqlite3

In [3]:
#Connecting with the database (If there is no database exists, It will create one.)

db= sqlite3.connect("my_database.db")

In [4]:
cursor= db.cursor()

In [6]:
#Create Table

cursor.execute("CREATE TABLE scores3(gender TEXT, student_id INT PRIMERY KEY, marks INT)")

In [7]:
#Insert single record into the table.

cursor.execute("INSERT INTO scores3(gender, student_id,marks) VALUES('Female', 10, 55)")

In [8]:
#Save the records permanently. (If you don't commit next time you won't see the records in the table.)

db.commit()

In [9]:
#Let's insert one more data( Make sure there is no duplicate insertion in the Primery key)

cursor.execute("INSERT INTO scores3(gender, student_id, marks) VALUES ('Male', 102, 70)")

In [10]:
#Using SELECT query to fetch records from the table.

result= cursor.execute("SELECT * FROM scores3")

for row in result:
    print(row)

('Female', 10, 55)
('Male', 102, 70)

In [11]:
#Multiple records insertion.

cursor.execute("INSERT INTO scores3(gender, student_id, marks) VALUES ('Female', 103, 44), ('Male', 104, 80)")

db.commit()

In [12]:
#Let's check count of the records.

print(cursor.rowcount, "Records Inserted")

2 Records Inserted

In [13]:
# Check if we have all the records.

result= cursor.execute("SELECT * FROM scores3")

for row in result:
    print(row)

('Female', 10, 55)
('Male', 102, 70)
('Female', 103, 44)
('Male', 104, 80)

In [14]:
#Selecting only perticular columns.

result= cursor.execute("SELECT student_id, gender FROM scores3")

for row in result:
    print(row)

(10, 'Female')
(102, 'Male')
(103, 'Female')
(104, 'Male')

In [15]:
#Inserting records file from CSV.

with open ('Scores_file.csv', 'r') as file:
    no_records = 0
    
    for row in file:
        cursor.execute("INSERT INTO scores3 VALUES (?,?,?)", row.split(","))
        db.commit()
        no_records +=1

In [16]:
print(no_records, 'Records Inserted')

26 Records Inserted

In [17]:
result= cursor.execute('SELECT * FROM scores3')

for row in result:
    print(row)

('Female', 10, 55)
('Male', 102, 70)
('Female', 103, 44)
('Male', 104, 80)
('ï»¿gender', 'student_id', 'marks\n')
('Male', 105, 50)
('Male', 106, 80)
('Female', 107, 90)
('Male', 108, 66)
('Female', 109, 55)
('Male', 110, 44)
('Male', 111, 29)
('Female', 112, 13)
('Male', 113, 12)
('Female', 114, 34)
('Male', 115, 36)
('Male', 116, 41)
('Female', 117, 52)
('Male', 118, 67)
('Female', 119, 84)
('Male', 120, 85)
('Male', 121, 89)
('Female', 122, 95)
('Male', 123, 96)
('Female', 124, 78)
('Male', 125, 77)
('Male', 126, 76)
('Female', 127, 71)
('Male', 128, 72)
('Female', 129, 70)

In [18]:
#WHERE Clause- Select records based on condition.

sql= "SELECT * FROM scores3 WHERE student_id = 105"

result= cursor.execute(sql)
for row in result:
    print(row)

('Male', 105, 50)

In [19]:
#DELETE Unwanted records.

sql= 'DELETE FROM scores3 WHERE student_id = 10'

db.commit()
cursor.execute(sql)

In [20]:
result= cursor.execute("SELECT * FROM scores3")

for row in result:
    print(row)

('Male', 102, 70)
('Female', 103, 44)
('Male', 104, 80)
('ï»¿gender', 'student_id', 'marks\n')
('Male', 105, 50)
('Male', 106, 80)
('Female', 107, 90)
('Male', 108, 66)
('Female', 109, 55)
('Male', 110, 44)
('Male', 111, 29)
('Female', 112, 13)
('Male', 113, 12)
('Female', 114, 34)
('Male', 115, 36)
('Male', 116, 41)
('Female', 117, 52)
('Male', 118, 67)
('Female', 119, 84)
('Male', 120, 85)
('Male', 121, 89)
('Female', 122, 95)
('Male', 123, 96)
('Female', 124, 78)
('Male', 125, 77)
('Male', 126, 76)
('Female', 127, 71)
('Male', 128, 72)
('Female', 129, 70)

In [21]:
#ORDER BY. How to change the order of the records (Increasing or Decreasing). (FOR ASSCENDING we don't need to mention anything after marks only ORDER BY will work.)

result= cursor.execute("SELECT * FROM scores3 ORDER BY marks desc")

for row in result:
    print(row)

('ï»¿gender', 'student_id', 'marks\n')
('Male', 123, 96)
('Female', 122, 95)
('Female', 107, 90)
('Male', 121, 89)
('Male', 120, 85)
('Female', 119, 84)
('Male', 104, 80)
('Male', 106, 80)
('Female', 124, 78)
('Male', 125, 77)
('Male', 126, 76)
('Male', 128, 72)
('Female', 127, 71)
('Male', 102, 70)
('Female', 129, 70)
('Male', 118, 67)
('Male', 108, 66)
('Female', 109, 55)
('Female', 117, 52)
('Male', 105, 50)
('Female', 103, 44)
('Male', 110, 44)
('Male', 116, 41)
('Male', 115, 36)
('Female', 114, 34)
('Male', 111, 29)
('Female', 112, 13)
('Male', 113, 12)

In [22]:
#Single record update.

sql= "UPDATE scores3 SET marks =50 WHERE student_id = 109"

cursor.execute(sql)

In [23]:
#Check if the marks got updated.

sql= "SELECT * FROM scores3 WHERE student_id= 109"

result= cursor.execute(sql)
for row in result:
    print(row)

('Female', 109, 50)

In [24]:
#Multiple records update using 'IN'

sql= "UPDATE scores3 SET marks =35 WHERE student_id IN (112,113)"
cursor.execute(sql)

In [25]:
#Verify

result= cursor.execute("SELECT * FROM scores3 ORDER BY student_id")
for row in result:
    print(row)

('Male', 102, 70)
('Female', 103, 44)
('Male', 104, 80)
('Male', 105, 50)
('Male', 106, 80)
('Female', 107, 90)
('Male', 108, 66)
('Female', 109, 50)
('Male', 110, 44)
('Male', 111, 29)
('Female', 112, 35)
('Male', 113, 35)
('Female', 114, 34)
('Male', 115, 36)
('Male', 116, 41)
('Female', 117, 52)
('Male', 118, 67)
('Female', 119, 84)
('Male', 120, 85)
('Male', 121, 89)
('Female', 122, 95)
('Male', 123, 96)
('Female', 124, 78)
('Male', 125, 77)
('Male', 126, 76)
('Female', 127, 71)
('Male', 128, 72)
('Female', 129, 70)
('ï»¿gender', 'student_id', 'marks\n')

In [26]:
#Update record using BETWEEN(This will update all the records between the given range)

sql= "UPDATE scores3 SET marks= 70 WHERE student_id BETWEEN 120 AND 128"

cursor.execute(sql)

In [27]:
result= cursor.execute("SELECT * FROM scores3 ORDER BY student_id")
for row in result:
    print(row)

('Male', 102, 70)
('Female', 103, 44)
('Male', 104, 80)
('Male', 105, 50)
('Male', 106, 80)
('Female', 107, 90)
('Male', 108, 66)
('Female', 109, 50)
('Male', 110, 44)
('Male', 111, 29)
('Female', 112, 35)
('Male', 113, 35)
('Female', 114, 34)
('Male', 115, 36)
('Male', 116, 41)
('Female', 117, 52)
('Male', 118, 67)
('Female', 119, 84)
('Male', 120, 70)
('Male', 121, 70)
('Female', 122, 70)
('Male', 123, 70)
('Female', 124, 70)
('Male', 125, 70)
('Male', 126, 70)
('Female', 127, 70)
('Male', 128, 70)
('Female', 129, 70)
('ï»¿gender', 'student_id', 'marks\n')

In [28]:
#MIN and MAX function

#Min

result= cursor.execute("SELECT MIN(marks) FROM scores3")

print("Minimum Marks= ", result.fetchone())

Minimum Marks=  (29,)

In [29]:
#MAX

result= cursor.execute("SELECT MAX(marks) FROM scores3")

print("Maximum Marks= ", result.fetchone())

Maximum Marks=  ('marks\n',)

In [30]:
#Subquery

db= sqlite3.connect("student_course_database.db")

cur= db.cursor()

In [32]:
cur.execute("CREATE TABLE course1(courseid INT PRIMERY KEY, coursename TEXT, duration INT)")

In [35]:
cur.execute("CREATE TABLE student1(roll_num INT PRIMERY KEY, studentname TEXT, age INT, courseid INT, foreign key(courseid) references course1(courseid))")

In [37]:
cur.execute("INSERT INTO course1 VALUES(78, 'Data Science',12), (56,'Python course',4), (101, 'Database',7)")

print(cur.rowcount, "Records inserted")

db.commit;

3 Records inserted

In [40]:
result= cur.execute("SELECT * FROM course1")

result.fetchall()

[(78, 'Data Science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [41]:
cur.execute("INSERT INTO student1 VALUES (1,'Jim',22,78), (2,'Rudolf',18,78), (3,'John',21,56), (4,'Jack',21,56)")

print(cur.rowcount, "Records inserted")

db.commit()

4 Records inserted

In [43]:
result= cur.execute("SELECT * FROM student1")

result.fetchall()

[(1, 'Jim', 22, 78),
 (2, 'Rudolf', 18, 78),
 (3, 'John', 21, 56),
 (4, 'Jack', 21, 56)]

In [44]:
result= cur.execute("SELECT courseid FROM course1 WHERE coursename= 'Data Science'")

for i in result:
    print(i)

(78,)

In [45]:
results= cur.execute("SELECT * FROM student1 WHERE courseid= (SELECT courseid FROM course1 WHERE coursename= 'Data Science')")

results.fetchall()

[(1, 'Jim', 22, 78), (2, 'Rudolf', 18, 78)]

In [ ]:
print('%0.1f degree Celsius is equal to %0.1f degree Fahrenheit' %(celsius,fahrenheit))

In [47]:
results= cur.execute("SELECT * FROM student1 WHERE courseid= (SELECT courseid FROM course1 WHERE coursename= 'Python course')")

results.fetchall()

[(3, 'John', 21, 56), (4, 'Jack', 21, 56)]

In [50]:
#JOIN

#Create one more table students

cursor.execute("CREATE TABLE students (student_name TEXT, student_id INT PRIMEY KEY, Phone_num INT)")

In [51]:
cursor.execute("INSERT INTO students(student_name, student_id, phone_num) VALUES ('Sachin', 105, 5481215432),('Rakhi',106,543249643),('Rakesh',106,587166587)")

db.commit()

In [54]:
result= cursor.execute("SELECT * FROM students")

print('Name stud_ID phone_num \n=============================')

for row in result:
    print(row)

Name stud_ID phone_num
=============================
('Sachin', 105, 5481215432)
('Rakhi', 106, 543249643)
('Rakesh', 106, 587166587)

In [57]:
result= cursor.execute("SELECT * FROM scores1 ORDER BY marks")

for row in result:
    print(row)

('Male', 113, 12)
('Female', 112, 13)
('Male', 111, 29)
('Female', 114, 34)
('Male', 115, 36)
('Male', 116, 41)
('Female', 103, 44)
('Female', 103, 44)
('Male', 110, 44)
('Male', 105, 50)
('Female', 117, 52)
('Female', 10, 55)
('Female', 109, 55)
('Female', 10, 55)
('Male', 108, 66)
('Male', 118, 67)
('Male', 102, 70)
('Female', 129, 70)
('Female', 127, 71)
('Male', 128, 72)
('Male', 126, 76)
('Male', 125, 77)
('Female', 124, 78)
('Male', 104, 80)
('Male', 104, 80)
('Male', 106, 80)
('Female', 119, 84)
('Male', 120, 85)
('Male', 121, 89)
('Female', 107, 90)
('Female', 122, 95)
('Male', 123, 96)
('ï»¿gender', 'student_id', 'marks\n')

In [60]:
#INNER JOIN

sql= "SELECT students.student_id, students.student_name, scores1.gender, scores1.marks FROM scores1 INNER JOIN students ON students.student_id = scores1.student_id"

result= cursor.execute(sql)

for row in result:
    print(row)

(105, 'Sachin', 'Male', 50)
(106, 'Rakesh', 'Male', 80)
(106, 'Rakhi', 'Male', 80)

In [61]:
#LEFT JOIN
sql= "SELECT students.student_id, students.student_name, scores1.gender, scores1.marks FROM scores1 LEFT JOIN students ON students.student_id = scores1.student_id"

result= cursor.execute(sql)

for row in result:
    print(row)

(None, None, 'Female', 55)
(None, None, 'Male', 70)
(None, None, 'Female', 44)
(None, None, 'Male', 80)
(None, None, 'Female', 44)
(None, None, 'Male', 80)
(None, None, 'ï»¿gender', 'marks\n')
(105, 'Sachin', 'Male', 50)
(106, 'Rakesh', 'Male', 80)
(106, 'Rakhi', 'Male', 80)
(None, None, 'Female', 90)
(None, None, 'Male', 66)
(None, None, 'Female', 55)
(None, None, 'Male', 44)
(None, None, 'Male', 29)
(None, None, 'Female', 13)
(None, None, 'Male', 12)
(None, None, 'Female', 34)
(None, None, 'Male', 36)
(None, None, 'Male', 41)
(None, None, 'Female', 52)
(None, None, 'Male', 67)
(None, None, 'Female', 84)
(None, None, 'Male', 85)
(None, None, 'Male', 89)
(None, None, 'Female', 95)
(None, None, 'Male', 96)
(None, None, 'Female', 78)
(None, None, 'Male', 77)
(None, None, 'Male', 76)
(None, None, 'Female', 71)
(None, None, 'Male', 72)
(None, None, 'Female', 70)
(None, None, 'Female', 55)

In [63]:
#DROP TABLE 

sql= "DROP TABLE students"

cursor.execute(sql)

In [64]:
db.commit()

In [65]:
db.close()

In [ ]:
import math
class circle_compute():
    def __init__(self,my_radius):
        self.radius=my_radius
    def area_calculate(self):
        return math.pi*(self.radius**2)
    def perimeter_calculate(self):
        return 2*math.pi*self.radius
my_result = int(input("Enter the radius of circle..."))
my_instance = circle_compute(my_result)
print("The radius entered is :")
print(my_result)
print("The computed area of circle is ")
print(round(my_instance.area_calculate(),2))
print("The computed perimeter of circle is :")
print(round(my_instance.perimeter_calculate(),2))